---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.ReverseIterator
source: html/c68acc0c-c482-1ab2-0bac-1c6be4709fbd.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireConduitTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.